---
title: MemberForces
classe: Autodesk.Revit.DB.Structure.MemberForces
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# MemberForces

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ Force { get; set; }` | `memberForces.Force` | XYZ |
| `Boolean IsValidObject { get; }` | `memberForces.IsValidObject` | Boolean |
| `XYZ Moment { get; set; }` | `memberForces.Moment` | XYZ |
| `Boolean Start { get; set; }` | `memberForces.Start` | Boolean |
| `Void Dispose()` | `memberForces.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```